# 1 თემა: ფინანსები – „დაზოგვის მიზანი“დავალება: მომხმარებელს აქვს მიზანი, დაზოგოს გარკვეული თანხა (მაგალითად, 500 ლარი). მან ყოველდღე უნდა შეიყვანოს,
# თუ რამდენი ლარი დაზოგა. პროგრამამ მანამ უნდა სთხოვოს თანხის შეყვანა, სანამ მიზანს არ მიაღწევს. ბოლოს დაბეჭდეთ, რამდენი დღე დასჭირდა მიზნის მისაღწევად.

goal = 500
day = 0
money = 0
while money < goal:
    daily_amount = float(input(f"დღეს რამდენი დაზოგე? დარჩენილია: {goal - money} დღეს დაზოგილი თანხაა: "))
    money += daily_amount
    day += 1
print(f"გილოცავ შენ მიაღწიე მიზანს:  {day}  დღეშე დაზოგილი თანხა: {money} ")

# 2 თემა: უსაფრთხოება – „მინიმუმ 8 სიმბოლო“დავალება: მომხმარებელს სთხოვე ახალი პაროლის შექმნა. პაროლი უნდა შედგებოდეს მინიმუმ 8 სიმბოლოსგან. მანამ
# სთხოვე პაროლის შეყვანა, სანამ პირობა არ დაკმაყოფილდება. (სიმბოლოების დასათვლელად გამოიყენე len()). გამოიყენეთ len().

password = input("crate password(min 8): ")
simbol = 8

if len(password) >= 8:   
    print("გილოცავ პაროლი წარმატებით შეიქმნა")
else:
    print("მინიმუმ 8 სიმბოლო")

# 3 თემა: სტატისტიკა – „მხოლოდ კენტების ჯამი“დავალება: მომხმარებელს შეაყვანინე რიცხვები მანამ,
# სანამ არ შეიყვანს 0-ს. პროგრამამ უნდა დააჯამოს მხოლოდ ის რიცხვები, რომლებიც იყო კენტი.

x = int(input("enter x: "))
kenti = 0
while x != 0:
    x = int(input("enter x: "))
    if x % 2 == 1:
        kenti += x
print(kenti)        

# 4 თემა: თამაში – „კამათლების გაგორება“დავალება: პროგრამამ უნდა "გააგოროს" ორი კამათელი
# (რიცხვები 1-დან 6-მდე), სანამ ორივეზე არ ამოვა ერთნაირი რიცხვი (დუბლი). ყოველ გაგორებაზე დაბეჭდე რიცხვები

x = int(input("პირველი კამათელი(1 - 6): "))
y = int(input("მეორე კამათელი(1 - 6): "))

while x != y:
    if x > 6 and y > 6:
        print("რიცხვი მეტია 6 ზე")
    x = int(input("პირველი კამათელი(1 - 6): "))
    y = int(input("მეორე კამათელი(1 - 6): "))
    
print("გილოცავ შენ გააგორე დუბლი")

# 5 თემა: მათემატიკა – „ფაქტორიალის გამოთვლა“დავალება: მომხმარებელს შეაყვანინე რიცხვი n და გამოთვალე 
# მისი ფაქტორიალი (მაგალითად, 5-ის ფაქტორიალია 12345 = 120). გამოიყენე while ციკლი.

n = int(input("enter n: "))
x = 1
factorial = 1
while x <= n:
    factorial *= x
    x += 1
print(f"{n} ის ფაქტორიალი არის {factorial}")





    
