# 1 მოცემულია რიცხვების სია [12, 7, 19, 24, 33, 40, 55]. შექმენით ახალი ცარიელი სია. for ციკლისა და append() მეთოდის გამოყენებით
# ახალ სიაში გადაიტანეთ საწყისი სიიდან მხოლოდ ლუწი რიცხვები. ბოლოს დაბეჭდეთ ახალი სია.

nums = [12, 7, 19, 24, 33, 40, 55]
luwi = []
for num in nums:
    if num % 2 == 0:
        luwi.append(num)
        print(nums)
        print(luwi)


# 2 მოცემულია ბრენდების სია. შეამოწმეთ, არის თუ არა სიაში ბრენდი 'nike'. თუ არის, index() მეთოდით იპოვეთ მისი პოზიცია და დაბეჭდეთ:
# "nike ნაპოვნია ინდექსზე: [ინდექსი]". თუ არ არის, append() მეთოდით დაამატეთ ის სიის ბოლოში.

brends = ["adidas", "puma", "nike", "lacoste", "margiella"]
if "nike" in brends:
    brends.index("nike")
    index = brends.index("nike")
    print(f"nike napovnia: {index} e indeqsze ")
else:
    brends.append("nike")
print(brends)

# 3 მოცემულია სახელების სია, სადაც სახელი 'Anano' რამდენჯერმე მეორდება. while ციკლისა და count() მეთოდის გამოყენებით შეამოწმეთ,
#  სანამ 'Anano'-ს რაოდენობა სიაში 1-ზე მეტია, remove() მეთოდით წაშალეთ მისი დუბლიკატები, რათა სიაში მხოლოდ ერთი დარჩეს.

names =["anano", "nika", "anano", "giorgi", "elene", "anano"]
while names.count("anano") != 1:
    names.remove("anano")
print(names)

# 4 მოცემულია ციფრების სია [10, 20, 30, 40, 50]. while ციკლის გამოყენებით, მანამ, სანამ სიის სიგრძე (len) 2-ზე მეტია, pop()
# მეთოდით ამოიღეთ სიის ბოლო ელემენტი და დაუმატეთ ის ცვლადს total_sum. ბოლოს დაბეჭდეთ დარჩენილი სია და მიღებული ჯამი.

nums = [10, 20, 30, 40, 50]
while len(nums) != 2:
    nums.pop()
print(nums)

# 5 მოცემულია ორი სხვადასხვა კლასის ნიშნების სიები. extend() მეთოდით გააერთიანეთ ეს ორი სია პირველ სიაში.
# შემდგომ, sort() მეთოდის გამოყენებით დაალაგეთ მიღებული ნიშნები კლებადობის მიხედვით და დაბეჭდეთ შედეგი.

class1 = [10, 9, 2, 10, 5, 8, 9, 1]
class2 = [5, 6, 4, 7, 9, 8, 10, 10]
class1.extend(class2)
class1.sort(reverse = True)
print(class1)

# 6 მოცემულია სია ['A', 'B', 'C', 'D']. for ციკლისა და insert() მეთოდის გამოყენებით, ყოველი ელემენტის შემდეგ ჩასვით სიმბოლო '-'.
# (მიაქციეთ ყურადღება, რომ ჩასმისას სიის სიგრძე იზრდება, ამიტომ გამოიყენეთ ინდექსებზე მანიპულაცია ან ახალი სია).

sia = ['A', 'B', 'C', 'D']  
s = 1
for i in sia.copy():
    sia.insert(s, "-")
    s += 2
print(sia)

# 7 მოცემულია მიმდინარე დღის შეკვეთების ID-ები [101, 102, 103]. copy() მეთოდით შექმენით ამ სიის არქივი (ასლი) სახელით archive_orders. მას შემდეგ, რაც დარწმუნდებით,
# რომ ასლი წარმატებით შეიქმნა (if შემოწმებით), ორიგინალი სია clear() მეთოდით მთლიანად წაშალეთ (გაასუფთავეთ).
id = [101, 102, 103]
archive_orders = id.copy()
if archive_orders == id:
    id.clear()
print(id)
print(archive_orders)

# 8 მოცემულია ასოების სია, რომელიც ადგენს სიტყვას ['r', 'a', 'd', 'a', 'r']. შექმენით ამ სიის ასლი, შემოატრიალეთ ასლი reverse() 
# მეთოდით და შეამოწმეთ, არის თუ არა ორიგინალი სია და შემოტრიალებული სია იდენტური. თუ კი, დაბეჭდეთ "სიტყვა პალინდრომია".

x = ['r', 'a', 'd', 'a', 'r']
x_copy = x.copy()
x_copy.reverse()     
if x_copy == x:
    print("სიტყვა პალინდრომია")
else:
    print("არ არის პალინდრომი")

# საწყისეტაპზე გაქვთ მოცემული რიცხვების სია [5, 15, 25]. while ციკლის გამოყენებით, მანამ, სანამ სიის სიგრძე len() ნაკლებია 7-ზე,
# append() მეთოდით ყოველ ბიჯზე სიას ბოლოში დაამატეთ 10-ით მეტი რიცხვი, ვიდრე სიის ბოლო ელემენტი იყო (მაგ: 25-ის მერე დაემატება 35, მერე 45 და ა.შ).

digit = [5, 15, 25]
x = 25
while len(digit) < 7:
    x += 10
    digit.append(x)
print(digit)

# მოცემულია ხილის სია. for ციკლის გამოყენებით გადაუარეთ სიას და თუ ხილის დასახელება შეიცავს ასო 'a'-ს (ანუ if 'a' in fruit),
# remove() მეთოდით წაშალეთ იგი სიიდან. (მიმანიშნებელი: იმისათვის, რომ ციკლში წაშლამ ინდექსები არ აურიოს, ციკლი გაატარეთ სიის კოპიოზე).
fruits = ["banana", "apple", "pinaple", "stobery"]
copy_fruits = fruits.copy()
for i in copy_fruits:
    if "a" in i:
        fruits.remove(i)   
print(copy_fruits)
print(fruits)