# მომხმარებელმა შეიყვანა სახელი არეული ასოებით (მაგ: "აᲜᲐ" ან "gEorGe"). გახადეთ სახელი სტანდარტული (პირველი ასო დიდი, დანარჩენი პატარა).
name = input("enter your name: ")
print(name.capitalize())

# იმეილის შემოწმება (Search Methods)პირობა: შეამოწმეთ, მთავრდება თუ არა ელ-ფოსტის მისამართი სუფიქსით ".com".
email = input("enter your email: ")
print(email.endswith(".com"))

# ზედმეტი space მოცილება პირობა: მომხმარებელმა პაროლის შეყვანისას შემთხვევით დასაწყისში და ბოლოში აკრიფა ცარიელი სივრცეები. გაასუფთავეთ ტექსტი.
pas = input("enter password: ")
print(pas.strip())

# ტექსტის ჩანაცვლება პირობა: წინადადებაში "მე მიყვარს ჯავასკრიპტი" ჩაანაცვლეთ სიტყვა "ჯავასკრიპტი" სიტყვით "პითონი".
x = "i love javascript"
print(x.replace("javascript", "pithon"))

# სიტყვების დათვლა პირობა: მოცემულია მძიმით გამოყოფილი პროდუქტების სია. დაყავით ის ცალკეულ ელემენტებად (სპეციალურ სიად) და დაბეჭდეთ სიგრძე.
leters =" a, b, n, n, b, g"
print(len(leters.split(",")))

# ტექსტის აწყობა პირობა: გაქვთ თარიღის ნაწილების სია ['2026', '05', '15']. შეაერთეთ ისინი ისე, რომ მიიღოთ ფორმატი "2026/05/15".
x = ['2026', '05', '15']
print("/".join(x))

# ტექსტის ძებნა და პოზიცია პირობა: ტექსტში ტექსტის ძებნა და პოზიცია პირობა: ტექსტში "სასწრაფო შეტყობინება: "შეცდომა სისტემაში იპოვეთ სიტყვა "შეცდომა"-ს საწყისი ინდექსი (პოზიცია)
x ="სასწრაფო შეტყობინება: შეცდომა სისტემაში"
print(x.find("შეცდომა"))

# მხოლოდ ციფრების პირობა: შეამოწმეთ, შედგება თუ არა მომხმარებლის მიერ შეყვანილი ტელეფონის ნომერი მხოლოდ ციფრებისგან (ჰარების და სიმბოლოების გარეშე).
number = input("enter your phone number: ")
print(number.isdigit())

# ასოების დათვლა პირობა: დაითვალეთ, რამდენჯერ მეორდება ასო "ა" წინადადებაში: "აი ია, კარგად იარეო".
# print("აი ია, კარგად იარეო".count("ა"))

# პირობა: ვებსაიტის ბმულზე შეამოწმეთ, იწყება თუ არა ის უსაფრთხო პროტოკოლით ("https://").
print("https://www.youtube.com/".startswith("https://"))