print(12 + 66)
print(90 + 16)
print(11 + 18) # მიმატება (+) მას ვიყენებთ ციფრების შესაკრებად 
print(44 + 19)
print(17 + 10)

print(99 - 10)
print(12 - 11)
print(19 - 11) # გამოკლება (-) მას ვიყენებთ ციფრის მეორე ციფრზე გამოსაკლებად
print(47 - 28)
print(119 - 7)

print(5 * 5)
print(7 * 9)
print(2 * 4) # გამრავლება (*) მას ვიყენებთ ციფრების ერთმანეთზე გასამრავლებლად
print(9 * 7)
print(7 * 3)

print(48 / 5)
print(86 / 9)
print(68 / 3) # ათწილადებად გაყოფა (/) ეს გამოიყენება მაშინ როდესაც გვინდა რიცხვების ათწილადებად გაყოფა
print(13 / 5)
print(99 / 7)

print(60 // 6)
print(63 // 9)
print(12 // 3) # გაყოფა (//) ეს გამოიყენება ციფრების ერთმანეთზე გასაყოფად
print(20 // 5)
print(50 // 5)

print(3 ** 3)
print(5 ** 5)
print(9 ** 3) # ახარისხება (**) ამით ჩვენ შეგვიძლია რიცხვის თავისთავზე გამრავლება
print(7 ** 5)
print(2 ** 9)

# veb development არის ვებ საიტების და ვებ აპლიკაციების შექმნა ის შედგება 2 ნაწილისგან frontend და beckend-ისგან 
# frontend არის ნაწილი რასაც მომხმარებელი ხედავს ხოლო
# beckend ის სერვერებში არის გაშვებული მომხმარებლის მოთხოვნა და მუშავდება მაგალითად სხვა გვერდზე გადასვლა და ა.შ.